app/controllers/comments_controller.rb

SELECT  "grams".* FROM "grams" WHERE "grams"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("message", "user_id", "gram_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", "wow"], ["user_id", 1], ["gram_id", 5], ["created_at", "2019-11-01 00:56:20.131991"], ["updated_at", "2019-11-01 00:56:20.131991"]]
---
  def create
    @gram = Gram.find_by_id(params[:gram_id])
    return render_not_found if @gram.blank?
    @gram.comments.create(comment_params.merge(user: current_user))