app/controllers/grams_controller.rb

  def index
   @grams = Gram.all
---
SELECT "grams".* FROM "grams"

  def create
    @gram = current_user.grams.create(gram_params)
---
INSERT INTO "grams" ("message", "created_at", "updated_at", "user_id", "picture") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", "cover!"], ["created_at", "2019-10-30 22:25:03.391478"], ["updated_at", "2019-10-30 22:25:03.391478"], ["user_id", 1], ["picture", "Cover.jpg"]]

  def show
    @gram = Gram.find_by_id(params[:id])
---
SELECT  "grams".* FROM "grams" WHERE "grams"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def edit
    @gram = Gram.find_by_id(params[:id])
---
SELECT  "grams".* FROM "grams" WHERE "grams"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    @gram = Gram.find_by_id(params[:id])
    return render_not_found if @gram.blank?
    if @gram.user != current_user
      return render plain: 'Forbidden :(', status: :forbidden
    end
    @gram.update_attributes(gram_params)
---
SELECT  "grams".* FROM "grams" WHERE "grams"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "grams" SET "message" = $1, "updated_at" = $2 WHERE "grams"."id" = $3  [["message", "Calendar picture from september."], ["updated_at", "2019-11-01 18:49:50.877657"], ["id", 6]]

  def destroy
    @gram = Gram.find_by_id(params[:id])
    return render_not_found if @gram.blank?
    if @gram.user != current_user
      return render plain: 'Forbidden :(', status: :forbidden
    end
    @gram.destroy
---
SELECT  "grams".* FROM "grams" WHERE "grams"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "grams" WHERE "grams"."id" = $1  [["id", 5]]